sec_name = input("Введите вашу фамилию: ")
name = input("Введите свое имя: ")
group = input("Введите вашу группу: ")
city = input("В каком городе вы живете: ")
age = int(input("Сколько вам полных лет: "))
fav_item = input("Ваш любимый предмет: ")
hours = float(input("Сколько часов в неделю вы тратите на подготовку: "))




print('--------------------------')
print('Карточка студента')
print(f'Полное имя: {name} {sec_name}')
print(f'Возраст через 4 года: {age+4} лет')
print(f'Время подготовки за 4 недели: {hours*4} ч.')
print(f'Среднее время подготовки в день за семитдневную неделю: {hours/7:.2f} ч.')
print(f'Город: {city}')
print(f'Группа: {group}')
print(f'Любимый предмет: {fav_item}')
print('--------------------------')
